ir_version: 13
producer_name: "simple_onnx_example"
graph {
  node {
    input: "input"
    input: "W1"
    input: "B1"
    output: "fc1_out"
    name: "FullyConnected1"
    op_type: "Gemm"
  }
  node {
    input: "fc1_out"
    output: "relu_out"
    name: "Relu1"
    op_type: "Relu"
  }
  node {
    input: "relu_out"
    input: "W2"
    input: "B2"
    output: "old_output"
    name: "FullyConnected2"
    op_type: "Gemm"
  }
  node {
    input: "old_output"
    input: "output_initializer_W"
    input: "output_initializer_B"
    output: "output"
    name: "new_output"
    op_type: "Gemm"
  }
  name: "Simple3LayerNet"
  initializer {
    dims: 4
    dims: 8
    data_type: 1
    float_data: 0.58308417
    float_data: 0.13663217
    float_data: -0.8730549
    float_data: 1.635957
    float_data: 0.50524735
    float_data: 0.041094985
    float_data: 1.3184301
    float_data: -0.4608332
    float_data: -2.108297
    float_data: -1.8322065
    float_data: 0.6757073
    float_data: 0.9984565
    float_data: 0.104289286
    float_data: 0.3788728
    float_data: -0.02697056
    float_data: 0.46254122
    float_data: -0.18074352
    float_data: 0.4895205
    float_data: -0.49735466
    float_data: -2.088965
    float_data: -0.18687047
    float_data: -1.3561513
    float_data: -1.1919441
    float_data: 0.86557364
    float_data: -0.008533982
    float_data: 1.4420583
    float_data: -1.1563802
    float_data: -1.1114248
    float_data: 1.4735843
    float_data: 0.38264388
    float_data: 0.62053967
    float_data: -0.34044674
    name: "W1"
  }
  initializer {
    dims: 8
    data_type: 1
    float_data: -0.094284855
    float_data: 0.29773745
    float_data: -0.8388002
    float_data: -1.853492
    float_data: 0.03052634
    float_data: 1.9314212
    float_data: -0.61101246
    float_data: 0.016692704
    name: "B1"
  }
  initializer {
    dims: 8
    dims: 3
    data_type: 1
    float_data: -0.41911724
    float_data: -0.056190226
    float_data: 0.0
    float_data: 2.0372336
    float_data: 1.1506323
    float_data: 1.0
    float_data: -0.07131075
    float_data: -0.6936957
    float_data: 0.0
    float_data: 1.0400233
    float_data: 0.17648147
    float_data: 0.0
    float_data: 0.89225477
    float_data: -1.2435222
    float_data: 0.0
    float_data: -1.0535039
    float_data: -0.08947001
    float_data: 0.0
    float_data: 0.39978585
    float_data: 0.057227176
    float_data: 0.0
    float_data: -0.6842482
    float_data: 1.0566313
    float_data: 0.0
    name: "W2"
  }
  initializer {
    dims: 3
    data_type: 1
    float_data: 2.0324152
    float_data: -0.14824411
    float_data: 0.0
    name: "B2"
  }
  initializer {
    dims: 3
    dims: 32
    data_type: 1
    float_data: 1e-09
    float_data: 0.09801714
    float_data: 0.19509032
    float_data: 0.29028466
    float_data: 0.38268343
    float_data: 0.47139674
    float_data: 0.55557024
    float_data: 0.6343933
    float_data: 0.70710677
    float_data: 0.77301043
    float_data: 0.8314696
    float_data: 0.8819213
    float_data: 0.9238795
    float_data: 0.95694035
    float_data: 0.9807853
    float_data: 0.9951847
    float_data: 1.0
    float_data: 0.9951847
    float_data: 0.9807853
    float_data: 0.95694035
    float_data: 0.9238795
    float_data: 0.8819213
    float_data: 0.8314696
    float_data: 0.77301043
    float_data: 0.70710677
    float_data: 0.6343933
    float_data: 0.55557024
    float_data: 0.47139674
    float_data: 0.38268343
    float_data: 0.29028466
    float_data: 0.19509032
    float_data: 0.09801714
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 1.0
    float_data: 0.9951847
    float_data: 0.9807853
    float_data: 0.95694035
    float_data: 0.9238795
    float_data: 0.8819213
    float_data: 0.8314696
    float_data: 0.77301043
    float_data: 0.70710677
    float_data: 0.6343933
    float_data: 0.55557024
    float_data: 0.47139674
    float_data: 0.38268343
    float_data: 0.29028466
    float_data: 0.19509032
    float_data: 0.09801714
    float_data: 1.0000001e-09
    float_data: -0.09801714
    float_data: -0.19509032
    float_data: -0.29028466
    float_data: -0.38268343
    float_data: -0.47139674
    float_data: -0.55557024
    float_data: -0.6343933
    float_data: -0.70710677
    float_data: -0.77301043
    float_data: -0.8314696
    float_data: -0.8819213
    float_data: -0.9238795
    float_data: -0.95694035
    float_data: -0.98078525
    float_data: -0.9951847
    name: "output_initializer_W"
  }
  initializer {
    dims: 32
    data_type: 1
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    name: "output_initializer_B"
  }
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch_size"
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch_size"
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
}
opset_import {
  version: 25
}
