ir_version: 3
producer_name: "MATLAB Deep Learning Toolbox Converter for ONNX Model Format"
producer_version: "18.2.5"
domain: ""
doc_string: ""
graph {
  node {
    input: "input"
    input: "input_AvgImg"
    output: "input_Sub"
    name: "input_Sub"
    op_type: "Sub"
  }
  node {
    input: "input_Sub"
    output: "Operation_1_Flatten"
    name: "Operation_1_Flatten"
    op_type: "Flatten"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Operation_1_Flatten"
    input: "Operation_1_MatMul_W"
    output: "Operation_1_MatMul"
    name: "Operation_1_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_1_MatMul"
    input: "Operation_1_Add_B"
    output: "Operation_1_Add"
    name: "Operation_1_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_1_Add"
    output: "relu_1"
    name: "relu_1"
    op_type: "Relu"
  }
  node {
    input: "relu_1"
    input: "Operation_2_MatMul_W"
    output: "Operation_2_MatMul"
    name: "Operation_2_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_2_MatMul"
    input: "Operation_2_Add_B"
    output: "Operation_2_Add"
    name: "Operation_2_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_2_Add"
    output: "relu_2"
    name: "relu_2"
    op_type: "Relu"
  }
  node {
    input: "relu_2"
    input: "Operation_3_MatMul_W"
    output: "Operation_3_MatMul"
    name: "Operation_3_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_3_MatMul"
    input: "Operation_3_Add_B"
    output: "Operation_3_Add"
    name: "Operation_3_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_3_Add"
    output: "relu_3"
    name: "relu_3"
    op_type: "Relu"
  }
  node {
    input: "relu_3"
    input: "Operation_4_MatMul_W"
    output: "Operation_4_MatMul"
    name: "Operation_4_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_4_MatMul"
    input: "Operation_4_Add_B"
    output: "Operation_4_Add"
    name: "Operation_4_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_4_Add"
    output: "relu_4"
    name: "relu_4"
    op_type: "Relu"
  }
  node {
    input: "relu_4"
    input: "Operation_5_MatMul_W"
    output: "Operation_5_MatMul"
    name: "Operation_5_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_5_MatMul"
    input: "Operation_5_Add_B"
    output: "Operation_5_Add"
    name: "Operation_5_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_5_Add"
    output: "relu_5"
    name: "relu_5"
    op_type: "Relu"
  }
  node {
    input: "relu_5"
    input: "Operation_6_MatMul_W"
    output: "Operation_6_MatMul"
    name: "Operation_6_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "Operation_6_MatMul"
    input: "Operation_6_Add_B"
    output: "Operation_6_Add"
    name: "Operation_6_Add"
    op_type: "Add"
  }
  node {
    input: "Operation_6_Add"
    output: "relu_6"
    name: "relu_6"
    op_type: "Relu"
  }
  node {
    input: "relu_6"
    input: "linear_7_MatMul_W"
    output: "linear_7_MatMul"
    name: "linear_7_MatMul"
    op_type: "MatMul"
  }
  node {
    input: "linear_7_MatMul"
    input: "linear_7_Add_B"
    output: "old_output"
    name: "linear_7_Add"
    op_type: "Add"
  }
  node {
    input: "old_output"
    input: "output_initializer_W"
    input: "output_initializer_B"
    output: "linear_7_Add"
    name: "new_output"
    op_type: "Gemm"
  }
  name: "Network"
  initializer {
    dims: 1
    dims: 1
    dims: 1
    dims: 5
    data_type: 1
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    float_data: 0.0
    name: "input_AvgImg"
  }
  initializer {
    dims: 5
    dims: 51
    data_type: 1
    float_data: 0.0540062
    float_data: -1.12374
    float_data: 0.196019
    float_data: -1.63015
    float_data: -0.355133
    float_data: -0.0341918
    float_data: 0.402002
    float_data: -1.41575
    float_data: -1.44498
    float_data: -1.1274
    float_data: 0.613717
    float_data: 0.933699
    float_data: -0.0408026
    float_data: -0.212265
    float_data: 0.032018
    float_data: -0.0124055
    float_data: -0.12243
    float_data: 0.0601742
    float_data: 0.0833034
    float_data: -1.18804
    float_data: -0.103537
    float_data: -0.0853903
    float_data: -0.0193838
    float_data: 0.0166866
    float_data: 0.00167639
    float_data: -0.897525
    float_data: -0.93322
    float_data: 0.160333
    float_data: 0.0834021
    float_data: 0.284019
    float_data: 1.37295
    float_data: -0.144445
    float_data: -1.3629
    float_data: -1.55178
    float_data: 1.29659
    float_data: 0.015868
    float_data: -0.0415857
    float_data: -0.0826992
    float_data: -1.59025
    float_data: 0.0283388
    float_data: 0.139212
    float_data: 0.257852
    float_data: 0.068648
    float_data: -0.74459
    float_data: -0.416569
    float_data: -0.632539
    float_data: 0.0392007
    float_data: -0.0385883
    float_data: -1.57631
    float_data: 0.620367
    float_data: 0.0
    float_data: -2.61092
    float_data: 0.0263619
    float_data: 0.242159
    float_data: -0.0344447
    float_data: 0.565969
    float_data: 1.4957
    float_data: 0.224022
    float_data: -0.0747429
    float_data: 0.0448403
    float_data: 0.0239891
    float_data: -0.55782
    float_data: 0.203647
    float_data: 0.548666
    float_data: -0.328003
    float_data: 0.422455
    float_data: 2.28453
    float_data: -0.712042
    float_data: -0.0639072
    float_data: -0.0407486
    float_data: 0.14463
    float_data: 0.0699915
    float_data: 0.175215
    float_data: 3.9939
    float_data: -0.654405
    float_data: 0.00538434
    float_data: -0.127606
    float_data: -0.0243277
    float_data: 0.00369291
    float_data: 2.01281
    float_data: -0.0465741
    float_data: 0.0058815
    float_data: 0.000607591
    float_data: -0.0207197
    float_data: 0.0838021
    float_data: 0.0938274
    float_data: 0.329773
    float_data: -1.47674
    float_data: 0.0025512
    float_data: 0.047571
    float_data: -0.0230824
    float_data: -0.572182
    float_data: -0.0626802
    float_data: 0.00245863
    float_data: 0.00311863
    float_data: 0.0120669
    float_data: -0.0358635
    float_data: 0.564469
    float_data: -0.123878
    float_data: 0.000440016
    float_data: 0.0750374
    float_data: 1.0
    float_data: -0.180027
    float_data: -0.00917929
    float_data: 0.638452
    float_data: -0.00605492
    float_data: 0.228267
    float_data: -1.53371
    float_data: -0.046716
    float_data: 0.0604386
    float_data: 0.00888916
    float_data: -0.00956711
    float_data: -0.0519507
    float_data: 0.166178
    float_data: 0.0574868
    float_data: 0.357536
    float_data: -0.568833
    float_data: 0.0534617
    float_data: 0.00915904
    float_data: -2.50281
    float_data: -0.752101
    float_data: -0.14928
    float_data: 2.42373
    float_data: -0.0874009
    float_data: 0.117807
    float_data: 0.560096
    float_data: -0.00726639
    float_data: 0.162803
    float_data: 0.230273
    float_data: 0.262149
    float_data: 0.35531
    float_data: 0.0074793
    float_data: 0.0130908
    float_data: -0.0211642
    float_data: 0.0445642
    float_data: -0.0352086
    float_data: 0.175474
    float_data: -0.265353
    float_data: -0.0579324
    float_data: 0.00987215
    float_data: 0.00763074
    float_data: -0.0763311
    float_data: 0.426805
    float_data: -0.331132
    float_data: -0.014261
    float_data: -0.187879
    float_data: -0.0481611
    float_data: 0.0283509
    float_data: 0.262818
    float_data: -0.762627
    float_data: -0.00832176
    float_data: -0.0146141
    float_data: 0.0
    float_data: 0.242194
    float_data: 0.055623
    float_data: -0.478265
    float_data: 0.0112076
    float_data: 0.177342
    float_data: 0.0405053
    float_data: 0.16389
    float_data: 0.0482656
    float_data: -0.25023
    float_data: 0.00892796
    float_data: 0.160852
    float_data: -0.00152163
    float_data: 0.142985
    float_data: -0.389715
    float_data: -0.210782
    float_data: 0.0580561
    float_data: -0.391123
    float_data: 0.0499702
    float_data: -0.118798
    float_data: -0.0360766
    float_data: 0.0226499
    float_data: -0.731836
    float_data: 0.0784146
    float_data: 0.196579
    float_data: 0.00418084
    float_data: -0.0481184
    float_data: -0.209033
    float_data: 0.281943
    float_data: 0.0360065
    float_data: -0.840513
    float_data: -0.0741005
    float_data: -0.647714
    float_data: 0.0394107
    float_data: 0.00605953
    float_data: 0.13344
    float_data: -0.103541
    float_data: -0.206667
    float_data: 0.0689708
    float_data: -0.0142601
    float_data: -0.77161
    float_data: -0.330029
    float_data: 0.329905
    float_data: 0.0279897
    float_data: 0.0136177
    float_data: -0.364603
    float_data: 0.0737678
    float_data: -0.0139606
    float_data: 0.0423037
    float_data: -0.0926607
    float_data: 0.262575
    float_data: 0.0
    float_data: 0.141407
    float_data: -0.327635
    float_data: 0.142577
    float_data: -0.0104997
    float_data: -0.208078
    float_data: 0.16435
    float_data: -0.160826
    float_data: -0.0560096
    float_data: 0.0653312
    float_data: -0.00458007
    float_data: -0.0971775
    float_data: -0.209448
    float_data: 0.0948681
    float_data: -0.459337
    float_data: 0.0757506
    float_data: 0.118652
    float_data: 0.0339849
    float_data: -0.0377898
    float_data: -0.218044
    float_data: -0.118933
    float_data: 0.0319605
    float_data: -0.22085
    float_data: -0.0145183
    float_data: -0.449805
    float_data: 0.00178105
    float_data: 0.0785461
    float_data: -0.0943662
    float_data: -0.551476
    float_data: -0.0996482
    float_data: -0.481789
    float_data: -0.155849
    float_data: -0.0182691
    float_data: 0.0935691
    float_data: 0.00828404
    float_data: 0.298777
    float_data: 0.0765932
    float_data: 0.201547
    float_data: -0.878938
    float_data: 0.00285048
    float_data: 0.499034
    float_data: 0.280864
    float_data: -0.856315
    float_data: -1.85103
    float_data: -0.015955
    float_data: 0.288194
    float_data: 0.0649997
    float_data: -0.357883
    float_data: 0.0498901
    float_data: -0.00493705
    float_data: -0.257948
    float_data: 0.0
    name: "Operation_1_MatMul_W"
  }
  initializer {
    dims: 51
    data_type: 1
    float_data: 0.22763
    float_data: -0.188762
    float_data: 0.0534094
    float_data: -0.377861
    float_data: -0.0812531
    float_data: -0.588651
    float_data: 0.0746065
    float_data: -0.392887
    float_data: -0.356303
    float_data: -0.167712
    float_data: 0.0587109
    float_data: 0.183917
    float_data: 0.131957
    float_data: -0.308681
    float_data: 0.196929
    float_data: 0.206664
    float_data: -0.311696
    float_data: 0.0306576
    float_data: -0.138822
    float_data: -0.347434
    float_data: -0.0045184
    float_data: -0.390616
    float_data: 0.0969635
    float_data: 0.00983266
    float_data: -0.0188585
    float_data: -0.231919
    float_data: -0.238165
    float_data: 0.0710148
    float_data: -0.141913
    float_data: -0.442307
    float_data: 0.559084
    float_data: 0.135483
    float_data: -0.373217
    float_data: -0.41539
    float_data: 0.759638
    float_data: 0.132825
    float_data: 0.235566
    float_data: 0.214858
    float_data: -0.440841
    float_data: -0.0772968
    float_data: 0.221606
    float_data: -0.00650873
    float_data: -0.634843
    float_data: -0.153833
    float_data: -0.0573027
    float_data: -0.109229
    float_data: 0.0370344
    float_data: 0.0538087
    float_data: -0.44755
    float_data: 0.175917
    float_data: 500.0
    name: "Operation_1_Add_B"
  }
  initializer {
    dims: 51
    dims: 52
    data_type: 1
    float_data: -0.184202
    float_data: 0.0171639
    float_data: 0.0698282
    float_data: 0.794837
    float_data: -0.0585128
    float_data: 0.0332535
    float_data: -0.2083
    float_data: -1.10533
    float_data: 0.0180697
    float_data: 0.234612
    float_data: -0.00582788
    float_data: 0.280057
    float_data: 0.108762
    float_data: -0.0876624
    float_data: -0.262059
    float_data: -0.667995
    float_data: -0.522074
    float_data: -0.295839
    float_data: -0.0597724
    float_data: 0.225581
    float_data: -0.0766084
    float_data: 0.0053438
    float_data: 0.316588
    float_data: -0.317647
    float_data: -0.0386614
    float_data: -0.0442498
    float_data: -0.0617362
    float_data: 0.0694637
    float_data: 0.0956433
    float_data: 0.189924
    float_data: -0.695974
    float_data: 0.889581
    float_data: -0.312797
    float_data: 0.193564
    float_data: -0.153071
    float_data: 0.147091
    float_data: 0.52024
    float_data: 0.00337957
    float_data: 0.0394096
    float_data: 0.544524
    float_data: 0.0672764
    float_data: -0.92864
    float_data: -0.0876844
    float_data: -0.136948
    float_data: 0.469926
    float_data: 0.517693
    float_data: -0.164987
    float_data: 0.396691
    float_data: -1.24508
    float_data: -0.348713
    float_data: -0.184202
    float_data: 0.0
    float_data: 0.0343834
    float_data: -0.0344739
    float_data: -0.00408911
    float_data: -0.36298
    float_data: 0.00708394
    float_data: -0.081036
    float_data: 0.835133
    float_data: 0.278798
    float_data: -0.120998
    float_data: -0.00865116
    float_data: 0.0164447
    float_data: 0.377801
    float_data: -0.024273
    float_data: 0.600703
    float_data: 0.661248
    float_data: -0.0202133
    float_data: -0.392761
    float_data: 0.48749
    float_data: -0.18151
    float_data: -0.13455
    float_data: 0.120952
    float_data: -0.00537545
    float_data: 0.941569
    float_data: -0.319918
    float_data: 0.0300274
    float_data: -0.022406
    float_data: 0.196832
    float_data: 0.234293
    float_data: 0.434045
    float_data: 0.0260059
    float_data: -0.129607
    float_data: 0.42773
    float_data: 0.520245
    float_data: 1.44523
    float_data: 0.0185324
    float_data: -0.920817
    float_data: -0.252208
    float_data: 0.00358123
    float_data: 0.55121
    float_data: 0.0611729
    float_data: -0.478893
    float_data: -0.0805053
    float_data: -0.0394447
    float_data: 0.00949599
    float_data: 0.408884
    float_data: -0.188861
    float_data: -0.0833527
    float_data: -0.0966309
    float_data: 0.562699
    float_data: 0.0989373
    float_data: 0.0343834
    float_data: 0.0
    float_data: -0.115142
    float_data: -0.00869311
    float_data: -0.277997
    float_data: -0.171911
    float_data: 0.268116
    float_data: -0.53441
    float_data: -0.151215
    float_data: -1.34995
    float_data: -0.193342
    float_data: 0.0404159
    float_data: -0.0498632
    float_data: -0.441952
    float_data: 0.439208
    float_data: -0.393411
    float_data: -0.425415
    float_data: -0.43026
    float_data: 0.290612
    float_data: -0.250767
    float_data: 0.234351
    float_data: 2.60395
    float_data: 0.159317
    float_data: -0.184408
    float_data: 0.342191
    float_data: -0.711323
    float_data: -0.0406126
    float_data: 0.0395571
    float_data: 0.775808
    float_data: -0.0384624
    float_data: -0.112437
    float_data: -0.267103
    float_data: 0.600306
    float_data: 0.102021
    float_data: -0.247811
    float_data: 0.659922
    float_data: 0.496609
    float_data: -0.670497
    float_data: 0.610368
    float_data: -0.0523126
    float_data: -0.0374195
    float_data: -0.100278
    float_data: 0.834231
    float_data: 0.0640302
    float_data: 0.0651309
    float_data: -0.138863
    float_data: 0.185463
    float_data: -0.110653
    float_data: 0.242473
    float_data: 0.524738
    float_data: 0.260105
    float_data: 0.176364
    float_data: -0.115142
    float_data: 0.0
    float_data: 0.184753
    float_data: 0.0381665
    float_data: 0.25879
    float_data: 0.0975946
    float_data: -0.00659521
    float_data: 0.667956
    float_data: 1.15162
    float_data: -0.0696007
    float_data: 0.85779
    float_data: 0.25135
    float_data: -0.0581705
    float_data: -1.27845
    float_data: 0.650574
    float_data: 1.05088
    float_data: 0.988594
    float_data: -0.598796
    float_data: -0.102772
    float_data: -0.797391
    float_data: 1.16461
    float_data: -0.27982
    float_data: -0.376492
    float_data: -0.142157
    float_data: -0.728312
    float_data: 1.59191
    float_data: 0.0106733
    float_data: 0.0281488
    float_data: -0.548274
    float_data: 1.88544
    float_data: 1.01573
    float_data: 0.770939
    float_data: 0.304015
    float_data: -0.0690815
    float_data: 0.60606
    float_data: 1.59422
    float_data: -0.176242
    float_data: 0.276299
    float_data: 0.869977
    float_data: -0.0435683
    float_data: 2.12755
    float_data: -0.416678
    float_data: -0.272691
    float_data: -0.263019
    float_data: 1.97424
    float_data: 0.0145009
    float_data: 0.868883
    float_data: 0.610181
    float_data: 0.850368
    float_data: 0.290395
    float_data: -0.236235
    float_data: 1.00371
    float_data: 0.184753
    float_data: 0.0
    float_data: -0.137148
    float_data: 0.021407
    float_data: 0.15582
    float_data: 0.0271402
    float_data: 0.315806
    float_data: -0.81253
    float_data: 0.221574
    float_data: 0.754957
    float_data: -1.75996
    float_data: 0.655618
    float_data: 0.0244792
    float_data: -0.298068
    float_data: 0.196522
    float_data: 0.260039
    float_data: -0.263324
    float_data: 0.353495
    float_data: 0.71297
    float_data: -0.232384
    float_data: 0.0971876
    float_data: -0.0326815
    float_data: -0.0740785
    float_data: -0.416168
    float_data: 1.44769
    float_data: 0.0841627
    float_data: -0.0154052
    float_data: 0.0075683
    float_data: 0.713229
    float_data: 0.0263936
    float_data: 0.210701
    float_data: -0.907456
    float_data: 0.564409
    float_data: -0.50109
    float_data: -0.308867
    float_data: 1.12143
    float_data: 0.13252
    float_data: -0.0595598
    float_data: -0.105383
    float_data: -0.0121571
    float_data: 0.0327126
    float_data: 0.0386408
    float_data: 0.120782
    float_data: 0.16609
    float_data: -0.247538
    float_data: 0.0200551
    float_data: -0.947657
    float_data: 0.357651
    float_data: -0.47946
    float_data: -0.141133
    float_data: -0.367931
    float_data: 0.217003
    float_data: -0.137148
    float_data: 0.0
    float_data: -0.189317
    float_data: 0.0421881
    float_data: -1.33151
    float_data: -0.415327
    float_data: -0.053758
    float_data: 1.29677
    float_data: 0.108233
    float_data: 2.57716
    float_data: -0.145697
    float_data: -0.187835
    float_data: 0.0157947
    float_data: 1.28171
    float_data: -0.838404
    float_data: -0.138641
    float_data: -0.0854719
    float_data: -0.464602
    float_data: -2.28415
    float_data: 0.418462
    float_data: 0.214008
    float_data: 2.94465
    float_data: -0.827363
    float_data: 0.363014
    float_data: 1.59755
    float_data: 1.87923
    float_data: 0.0442192
    float_data: 0.0148697
    float_data: -0.943687
    float_data: -0.140758
    float_data: -0.662638
    float_data: -1.08298
    float_data: 1.6221
    float_data: 0.0994008
    float_data: 0.0390312
    float_data: 0.154426
    float_data: -0.368707
    float_data: -1.80043
    float_data: -0.588515
    float_data: 0.0389191
    float_data: -0.0055392
    float_data: -0.143012
    float_data: -2.3506
    float_data: -1.66211
    float_data: -0.17824
    float_data: -0.240808
    float_data: -8.5792
    float_data: 1.10959
    float_data: 0.582513
    float_data: -1.89133
    float_data: -0.226799
    float_data: 0.244686
    float_data: -0.189317
    float_data: 0.0
    float_data: -0.748695
    float_data: 0.0215526
    float_data: -1.31188
    float_data: -0.0924507
    float_data: 0.365686
    float_data: 1.2687
    float_data: 0.065131
    float_data: 0.0865201
    float_data: 2.56764
    float_data: -0.628119
    float_data: -0.035586
    float_data: -0.54256
    float_data: 0.121426
    float_data: 0.319135
    float_data: 0.727248
    float_data: -0.12008
    float_data: 1.42424
    float_data: 0.387235
    float_data: 0.209933
    float_data: -0.379955
    float_data: -0.577585
    float_data: 0.345105
    float_data: 0.378296
    float_data: 1.01007
    float_data: 0.019789
    float_data: 0.0382801
    float_data: -0.826375
    float_data: -0.294075
    float_data: -1.03677
    float_data: -0.132564
    float_data: -0.286626
    float_data: 0.0777038
    float_data: 0.385516
    float_data: -0.32065
    float_data: -0.374178
    float_data: 0.48221
    float_data: -0.366213
    float_data: -0.0244973
    float_data: 0.131943
    float_data: 0.205194
    float_data: 0.405975
    float_data: -0.132093
    float_data: 0.370758
    float_data: -0.123084
    float_data: -3.50731
    float_data: 0.213089
    float_data: 0.982952
    float_data: -1.61072
    float_data: 0.239146
    float_data: 0.057497
    float_data: -0.748695
    float_data: 0.0
    float_data: 0.575849
    float_data: -0.033617
    float_data: -0.893189
    float_data: -0.602603
    float_data: 0.0360562
    float_data: 0.704389
    float_data: 0.145465
    float_data: 0.511288
    float_data: 0.782773
    float_data: 0.518079
    float_data: 0.00395222
    float_data: -0.346468
    float_data: 1.17039
    float_data: -0.597047
    float_data: 0.0519006
    float_data: -0.0441756
    float_data: 0.441092
    float_data: 0.960061
    float_data: 0.32958
    float_data: 1.06743
    float_data: -0.341195
    float_data: 0.296037
    float_data: -2.48756
    float_data: 0.789384
    float_data: -0.0104466
    float_data: -0.0241124
    float_data: 1.35313
    float_data: 0.650119
    float_data: 1.21557
    float_data: -0.0595572
    float_data: 0.89651
    float_data: 0.355447
    float_data: 0.228354
    float_data: 1.95374
    float_data: -0.666281
    float_data: 1.18207
    float_data: 0.30223
    float_data: 0.00833114
    float_data: 1.44832
    float_data: -0.202811
    float_data: -0.926539
    float_data: -1.32705
    float_data: 0.438517
    float_data: 0.0325245
    float_data: 1.1403
    float_data: 0.138339
    float_data: 1.07879
    float_data: 0.125004
    float_data: 0.663539
    float_data: 0.56687
    float_data: 0.575849
    float_data: 0.0
    float_data: -0.0133157
    float_data: -0.0474388
    float_data: 0.195445
    float_data: -0.320925
    float_data: -0.047443
    float_data: 0.11782
    float_data: 0.63193
    float_data: -0.0577744
    float_data: 0.450378
    float_data: -0.39667
    float_data: -0.0216416
    float_data: 0.275764
    float_data: 0.232818
    float_data: -0.705588
    float_data: -0.041103
    float_data: 0.161297
    float_data: 0.297105
    float_data: -0.191897
    float_data: -0.668421
    float_data: 0.257016
    float_data: 0.202595
    float_data: -0.124654
    float_data: 1.75363
    float_data: 0.503349
    float_data: -0.0295513
    float_data: 0.0136336
    float_data: -0.392385
    float_data: 0.187138
    float_data: 0.21533
    float_data: -0.379226
    float_data: -0.370437
    float_data: 0.122223
    float_data: 0.333615
    float_data: 1.13126
    float_data: 0.784158
    float_data: 0.163645
    float_data: 0.101059
    float_data: -0.00309726
    float_data: 0.398095
    float_data: -0.143623
    float_data: 0.469639
    float_data: 0.166086
    float_data: -0.052765
    float_data: 0.0788718
    float_data: 0.0518583
    float_data: -0.598133
    float_data: 0.726892
    float_data: -0.460584
    float_data: -0.859104
    float_data: -0.348277
    float_data: -0.0133157
    float_data: 0.0
    float_data: 0.143641
    float_data: 0.0213502
    float_data: 0.384027
    float_data: 0.43533
    float_data: -0.371296
    float_data: 0.0314183
    float_data: 0.108889
    float_data: -0.10405
    float_data: -0.0982587
    float_data: -0.78942
    float_data: 0.0112976
    float_data: 0.525215
    float_data: 0.304609
    float_data: 0.61651
    float_data: 1.03413
    float_data: 1.19578
    float_data: -0.119794
    float_data: 1.04525
    float_data: 0.293814
    float_data: -0.246081
    float_data: 0.209397
    float_data: 0.322052
    float_data: 1.64103
    float_data: 0.548707
    float_data: -0.000415195
    float_data: 0.0269792
    float_data: -0.373778
    float_data: 1.05286
    float_data: 0.199962
    float_data: -0.176419
    float_data: 0.0783919
    float_data: -0.330119
    float_data: -0.607636
    float_data: 0.748786
    float_data: 0.0972886
    float_data: 1.15554
    float_data: -0.278991
    float_data: -0.0167869
    float_data: 1.15941
    float_data: 0.722468
    float_data: 0.17459
    float_data: -0.129865
    float_data: 0.0938755
    float_data: 0.0204245
    float_data: 0.313976
    float_data: 0.0333181
    float_data: 0.529269
    float_data: 0.990398
    float_data: -0.828027
    float_data: 2.12931
    float_data: 0.143641
    float_data: 0.0
    float_data: 0.133067
    float_data: 0.00994309
    float_data: 0.0427115
    float_data: 0.52763
    float_data: 0.153974
    float_data: 0.345893
    float_data: 0.508279
    float_data: -0.423933
    float_data: -0.1247
    float_data: 0.175555
    float_data: 0.0100584
    float_data: -0.295772
    float_data: -0.535919
    float_data: -4.616
    float_data: 2.94721
    float_data: 0.163675
    float_data: -0.675246
    float_data: -0.651756
    float_data: -0.988543
    float_data: 0.00626051
    float_data: 0.0713967
    float_data: -0.235292
    float_data: 0.651603
    float_data: 0.615919
    float_data: -0.0114132
    float_data: 0.0396601
    float_data: 0.391178
    float_data: -0.392044
    float_data: 0.157218
    float_data: 0.132885
    float_data: -0.156796
    float_data: -0.418854
    float_data: -0.725812
    float_data: 0.111294
    float_data: -0.0192852
    float_data: 0.208565
    float_data: -0.307602
    float_data: -0.00753699
    float_data: -0.0985198
    float_data: -0.272663
    float_data: 0.0400554
    float_data: -0.334594
    float_data: -1.62234
    float_data: -0.136803
    float_data: 0.431151
    float_data: -0.286477
    float_data: -0.418537
    float_data: 0.149935
    float_data: -0.114967
    float_data: 0.262162
    float_data: 0.133067
    float_data: 0.0
    float_data: -0.224418
    float_data: 0.0277698
    float_data: -0.539398
    float_data: -0.415412
    float_data: -0.215701
    float_data: -1.27676
    float_data: -0.269129
    float_data: -0.213807
    float_data: -0.72638
    float_data: -0.392038
    float_data: -0.0641057
    float_data: -0.582597
    float_data: -1.06514
    float_data: 0.272411
    float_data: -0.602879
    float_data: 0.239733
    float_data: 0.132939
    float_data: -0.279784
    float_data: -0.289137
    float_data: 1.00429
    float_data: 0.221236
    float_data: -0.0980614
    float_data: 0.895939
    float_data: 0.395558
    float_data: -0.033954
    float_data: -0.0236657
    float_data: 1.71131
    float_data: -0.0288931
    float_data: -0.175469
    float_data: 0.0235959
    float_data: 0.0115489
    float_data: 0.105862
    float_data: -0.511116
    float_data: 1.05834
    float_data: 0.30612
    float_data: 0.123033
    float_data: 0.0397712
    float_data: -0.0139463
    float_data: -0.210324
    float_data: 0.0566484
    float_data: 0.296408
    float_data: 0.0661127
    float_data: 0.372372
    float_data: -0.0574912
    float_data: 1.84579
    float_data: 0.0409145
    float_data: -0.780971
    float_data: -0.403642
    float_data: 0.452936
    float_data: -0.51769
    float_data: -0.224418
    float_data: 0.0
    float_data: 0.302148
    float_data: 0.00492707
    float_data: 0.0812943
    float_data: -0.195773
    float_data: 0.14624
    float_data: 0.259326
    float_data: -0.198187
    float_data: 0.0263156
    float_data: -0.732309
    float_data: 0.277756
    float_data: 0.0240168
    float_data: 0.166079
    float_data: 0.869641
    float_data: 0.43197
    float_data: 0.664402
    float_data: 0.460481
    float_data: 0.143614
    float_data: 0.716194
    float_data: 0.152218
    float_data: 0.444224
    float_data: 0.267677
    float_data: 0.409397
    float_data: 1.0602
    float_data: -0.697982
    float_data: 0.00967678
    float_data: -0.0239268
    float_data: 0.177278
    float_data: 0.293739
    float_data: 0.307791
    float_data: -0.427154
    float_data: -0.546074
    float_data: -0.396614
    float_data: -1.2652
    float_data: 0.17786
    float_data: -0.832663
    float_data: 0.0145719
    float_data: 0.149832
    float_data: -0.0515684
    float_data: 0.0354951
    float_data: -0.464974
    float_data: -0.23935
    float_data: 0.633007
    float_data: 0.652717
    float_data: 0.0101873
    float_data: 0.244769
    float_data: -0.89652
    float_data: 0.365121
    float_data: -0.208745
    float_data: -0.0238205
    float_data: -0.112407
    float_data: 0.302148
    float_data: 0.0
    float_data: 0.0408489
    float_data: -0.0427201
    float_data: 0.401288
    float_data: -0.0372765
    float_data: 0.414588
    float_data: 0.755813
    float_data: 0.172319
    float_data: 3.1673
    float_data: 0.153515
    float_data: -1.05727
    float_data: 0.00582842
    float_data: 0.162596
    float_data: 0.496056
    float_data: -0.157418
    float_data: 1.78682
    float_data: 1.54292
    float_data: -0.00590757
    float_data: 0.342236
    float_data: -0.327873
    float_data: 1.98882
    float_data: -0.277037
    float_data: -0.0497859
    float_data: 0.332887
    float_data: -0.267981
    float_data: 0.0219783
    float_data: 0.0400947
    float_data: 0.111293
    float_data: -0.00315151
    float_data: 0.295498
    float_data: 0.0412024
    float_data: -0.31387
    float_data: -0.35208
    float_data: 0.0569628
    float_data: 0.173992
    float_data: -0.318517
    float_data: 0.483299
    float_data: 0.543451
    float_data: -0.0134991
    float_data: 0.0111342
    float_data: -0.0557419
    float_data: 1.19698
    float_data: 0.0379516
    float_data: -0.338896
    float_data: 0.0759982
    float_data: -0.017983
    float_data: 0.563481
    float_data: 0.717431
    float_data: -0.396032
    float_data: 0.482179
    float_data: -0.309114
    float_data: 0.0408489
    float_data: 0.0
    float_data: -0.339559
    float_data: -0.0240032
    float_data: -0.274514
    float_data: -1.00783
    float_data: -0.0522092
    float_data: 0.558989
    float_data: 0.325839
    float_data: 0.705454
    float_data: -0.0326798
    float_data: 0.526056
    float_data: -0.0351634
    float_data: 0.390477
    float_data: 0.154152
    float_data: -0.328696
    float_data: -1.78073
    float_data: 0.590185
    float_data: 0.319779
    float_data: 0.829823
    float_data: -1.00006
    float_data: 0.456873
    float_data: -0.0728074
    float_data: -0.375388
    float_data: -0.38988
    float_data: -2.10715
    float_data: -0.0582937
    float_data: -0.0536841
    float_data: -0.296716
    float_data: 0.0119241
    float_data: 0.424079
    float_data: -1.24642
    float_data: 0.423087
    float_data: -1.00883
    float_data: 0.847665
    float_data: 0.591047
    float_data: 0.159466
    float_data: -0.370696
    float_data: -0.0666054
    float_data: -0.0500966
    float_data: 0.0401923
    float_data: -0.935183
    float_data: 0.114479
    float_data: -0.387032
    float_data: 0.685237
    float_data: -0.146138
    float_data: -0.112137
    float_data: 0.105493
    float_data: 0.265642
    float_data: -1.32516
    float_data: 0.825268
    float_data: 0.119633
    float_data: -0.339559
    float_data: 0.0
    float_data: 0.064917
    float_data: -0.0322351
    float_data: 0.367932
    float_data: 0.133426
    float_data: -0.122101
    float_data: -0.12361
    float_data: 0.0612855
    float_data: 0.156442
    float_data: 0.0859862
    float_data: 0.510797
    float_data: 0.0137765
    float_data: 0.161276
    float_data: 0.0577726
    float_data: 0.519095
    float_data: 0.442521
    float_data: 0.55305
    float_data: 0.628752
    float_data: 0.148468
    float_data: 0.00650972
    float_data: 0.101207
    float_data: -0.121906
    float_data: -0.250969
    float_data: -1.51751
    float_data: 0.0295865
    float_data: 0.0227223
    float_data: 0.0164122
    float_data: 0.408424
    float_data: -0.0580794
    float_data: -0.701214
    float_data: 0.69487
    float_data: 0.440643
    float_data: -0.646376
    float_data: -0.195323
    float_data: -0.1564
    float_data: 0.17836
    float_data: 0.116619
    float_data: 0.453521
    float_data: 0.0318874
    float_data: 0.0671328
    float_data: -0.487267
    float_data: 0.118828
    float_data: -0.0128015
    float_data: -0.0467079
    float_data: -0.0910074
    float_data: 1.09834
    float_data: -1.18442
    float_data: -0.0855164
    float_data: -0.229743
    float_data: 0.161358
    float_data: 0.283863
    float_data: 0.064917
    float_data: 0.0
    float_data: 0.0731692
    float_data: 0.0133943
    float_data: -0.760605
    float_data: 0.248356
    float_data: -0.238432
    float_data: -0.316966
    float_data: -0.635311
    float_data: 0.115742
    float_data: -0.569807
    float_data: -0.106047
    float_data: -0.042078
    float_data: 0.0451447
    float_data: 0.088973
    float_data: -0.874161
    float_data: -0.194133
    float_data: 0.0333647
    float_data: 0.504229
    float_data: -0.113137
    float_data: 0.541077
    float_data: 0.291307
    float_data: 0.380108
    float_data: -0.0981585
    float_data: 0.195401
    float_data: 0.139486
    float_data: 0.0164509
    float_data: -0.0389649
    float_data: -0.550011
    float_data: -0.175109
    float_data: 0.00620567
    float_data: -0.186457
    float_data: 0.196042
    float_data: -0.14375
    float_data: -2.17945
    float_data: 1.00194
    float_data: 0.333991
    float_data: -0.202445
    float_data: 0.0148984
    float_data: 0.01181
    float_data: -0.0669259
    float_data: 0.0660513
    float_data: -0.726833
    float_data: 1.01307
    float_data: 0.0935516
    float_data: 0.0573273
    float_data: 0.479314
    float_data: -1.16413
    float_data: -0.0624654
    float_data: -0.785902
    float_data: -0.0338258
    float_data: 0.379286
    float_data: 0.0731692
    float_data: 0.0
    float_data: -0.459231
    float_data: -0.0423694
    float_data: -1.29349
    float_data: -1.69865
    float_data: -1.09953
    float_data: -1.38929
    float_data: -0.435558
    float_data: 0.889692
    float_data: 0.394019
    float_data: -1.67583
    float_data: -0.0348972
    float_data: -0.126315
    float_data: 0.488296
    float_data: -0.095202
    float_data: 0.621769
    float_data: 1.09549
    float_data: 0.807083
    float_data: -0.446995
    float_data: 0.409312
    float_data: 0.482486
    float_data: 0.687495
    float_data: 0.0722905
    float_data: 0.0682005
    float_data: -0.501845
    float_data: -0.028801
    float_data: 0.0311577
    float_data: -0.506212
    float_data: 0.153388
    float_data: -0.0681584
    float_data: 0.787567
    float_data: 0.0763858
    float_data: -5.94317
    float_data: 0.445048
    float_data: -0.55098
    float_data: 0.436896
    float_data: -3.19707
    float_data: -0.455494
    float_data: -0.0374396
    float_data: -0.197069
    float_data: -1.14682
    float_data: -0.384486
    float_data: -0.384665
    float_data: -0.501777
    float_data: -0.065921
    float_data: -0.432428
    float_data: 0.442435
    float_data: -0.0433837
    float_data: 0.120239
    float_data: 0.56836
    float_data: 0.0909194
    float_data: -0.459231
    float_data: 0.0
    float_data: 0.474744
    float_data: -0.0401146
    float_data: 1.4711
    float_data: 2.01099
    float_data: -3.20509
    float_data: -2.33073
    float_data: 0.590671
    float_data: 0.0485605
    float_data: 0.117462
    float_data: 1.80736
    float_data: -0.0375012
    float_data: -1.20241
    float_data: -0.707301
    float_data: 1.0002
    float_data: 0.388468
    float_data: -0.182515
    float_data: -1.6953
    float_data: -0.301331
    float_data: -1.00315
    float_data: 0.0628707
    float_data: -0.85154
    float_data: 0.540131
    float_data: 0.572131
    float_data: 5.97106
    float_data: -0.0246728
    float_data: 0.00923819
    float_data: -0.698154
    float_data: -0.237627
    float_data: 0.359171
    float_data: 0.301205
    float_data: 1.04211
    float_data: 6.3626
    float_data: 0.272476
    float_data: 0.421743
    float_data: -1.07546
    float_data: 4.6203
    float_data: 1.27761
    float_data: -0.00661598
    float_data: -0.10793
    float_data: 0.751996
    float_data: -0.630676
    float_data: 0.00750208
    float_data: -0.0820838
    float_data: 0.147955
    float_data: 1.70457
    float_data: -1.35846
    float_data: -0.474597
    float_data: -0.47498
    float_data: -1.88275
    float_data: -0.0207329
    float_data: 0.474744
    float_data: 0.0
    float_data: 0.377226
    float_data: -0.0174541
    float_data: 0.0977806
    float_data: -0.707126
    float_data: -0.438948
    float_data: 0.684739
    float_data: 0.0923703
    float_data: -0.329414
    float_data: 0.251221
    float_data: -0.23395
    float_data: -0.0257387
    float_data: 0.563122
    float_data: -0.0893437
    float_data: -0.296085
    float_data: -0.0222371
    float_data: 0.173915
    float_data: -2.90579
    float_data: 0.113571
    float_data: -0.668993
    float_data: -0.634902
    float_data: 0.148517
    float_data: 0.266987
    float_data: 0.35714
    float_data: -0.0728299
    float_data: 0.0300411
    float_data: -0.0169541
    float_data: -0.920523
    float_data: 0.218168
    float_data: 0.956768
    float_data: 0.487338
    float_data: 0.434497
    float_data: 0.767676
    float_data: -0.00239627
    float_data: 0.474903
    float_data: 0.288074
    float_data: -0.380048
    float_data: 0.0723849
    float_data: -0.047146
    float_data: 0.115893
    float_data: 0.776297
    float_data: -0.802355
    float_data: 0.483827
    float_data: 0.179616
    float_data: 0.0703083
    float_data: -0.68671
    float_data: 0.599078
    float_data: 0.263688
    float_data: 0.598314
    float_data: 0.745016
    float_data: 0.666918
    float_data: 0.377226
    float_data: 0.0
    float_data: -1.11407
    float_data: -0.0423118
    float_data: -0.790099
    float_data: 1.15497
    float_data: -0.260557
    float_data: 0.0419089
    float_data: -0.009911
    float_data: -7.39524
    float_data: 0.845853
    float_data: 0.701526
    float_data: -0.0546805
    float_data: 0.410249
    float_data: -4.56395
    float_data: -0.176376
    float_data: 0.0464028
    float_data: -2.19077
    float_data: 0.0504308
    float_data: -0.0545101
    float_data: -0.0659849
    float_data: -0.857219
    float_data: 0.243052
    float_data: 0.31857
    float_data: -0.176745
    float_data: 0.334278
    float_data: 0.0194892
    float_data: -0.0213906
    float_data: -0.804038
    float_data: 0.107495
    float_data: 0.239628
    float_data: 0.198397
    float_data: 1.10865
    float_data: 1.06944
    float_data: 0.878727
    float_data: 0.232618
    float_data: -0.149633
    float_data: 0.0601541
    float_data: -2.01327
    float_data: 0.0211228
    float_data: 0.193412
    float_data: 0.999378
    float_data: -1.88252
    float_data: -0.0300168
    float_data: 0.103024
    float_data: -0.0661596
    float_data: -0.269506
    float_data: -0.0404175
    float_data: 0.0366676
    float_data: -2.38218
    float_data: -0.0119559
    float_data: 0.288551
    float_data: -1.11407
    float_data: 0.0
    float_data: -0.571853
    float_data: 0.0146571
    float_data: -0.534664
    float_data: 0.527052
    float_data: -0.269236
    float_data: -0.641408
    float_data: -0.227569
    float_data: -0.587756
    float_data: 0.847721
    float_data: -0.541358
    float_data: -0.0358484
    float_data: -1.77284
    float_data: 0.174036
    float_data: -0.244104
    float_data: 0.726418
    float_data: 0.226521
    float_data: 0.66254
    float_data: -0.26255
    float_data: 0.314336
    float_data: 0.034626
    float_data: -0.186309
    float_data: 0.389736
    float_data: -0.0618688
    float_data: 0.252699
    float_data: -0.00242723
    float_data: -0.0342286
    float_data: 0.347287
    float_data: -0.0854477
    float_data: 0.180519
    float_data: -1.17986
    float_data: 1.14416
    float_data: -0.0252855
    float_data: -0.30221
    float_data: 0.767089
    float_data: 0.578693
    float_data: 0.17444
    float_data: 0.253964
    float_data: 0.0419343
    float_data: -0.186414
    float_data: 0.415307
    float_data: 1.50989
    float_data: 0.97097
    float_data: 0.0365015
    float_data: 0.105562
    float_data: -0.330778
    float_data: 1.98201
    float_data: 1.05476
    float_data: 1.42707
    float_data: -1.04783
    float_data: -0.0461617
    float_data: -0.571853
    float_data: 0.0
    float_data: 0.0499151
    float_data: -0.0313675
    float_data: 0.00720768
    float_data: -0.169422
    float_data: -0.0409149
    float_data: -0.0220248
    float_data: -0.39122
    float_data: 0.679489
    float_data: 0.421144
    float_data: 0.105999
    float_data: 0.00208489
    float_data: -0.219624
    float_data: -0.211087
    float_data: 0.401531
    float_data: 0.431174
    float_data: 0.262419
    float_data: -0.822735
    float_data: -1.23184
    float_data: -0.355661
    float_data: -0.656198
    float_data: -0.268694
    float_data: -0.00587657
    float_data: -0.512659
    float_data: -0.277681
    float_data: -0.0388959
    float_data: -0.0389736
    float_data: 0.492696
    float_data: 0.0282669
    float_data: 0.0732215
    float_data: 0.409079
    float_data: -0.33845
    float_data: -0.545631
    float_data: 0.0928734
    float_data: -0.087252
    float_data: -0.0163636
    float_data: 0.536912
    float_data: 0.530549
    float_data: -0.0287218
    float_data: -0.0141833
    float_data: -0.0259069
    float_data: -0.627703
    float_data: -0.516422
    float_data: -0.194073
    float_data: -0.0755332
    float_data: -0.658605
    float_data: -2.90362
    float_data: -0.184634
    float_data: 0.247473
    float_data: 1.10075
    float_data: -0.156872
    float_data: 0.0499151
    float_data: 0.0
    float_data: -0.254206
    float_data: 0.0384782
    float_data: -0.553668
    float_data: 0.363558
    float_data: 0.369151
    float_data: -0.815136
    float_data: 0.0431908
    float_data: 0.404011
    float_data: 0.573381
    float_data: -0.167828
    float_data: -0.0363354
    float_data: -0.124339
    float_data: -0.479564
    float_data: -0.950305
    float_data: -1.12577
    float_data: 0.995612
    float_data: 0.309652
    float_data: 0.184642
    float_data: -0.0508591
    float_data: -0.154894
    float_data: 0.137717
    float_data: -0.537369
    float_data: -1.00565
    float_data: -0.273976
    float_data: -0.0476972
    float_data: -0.0228373
    float_data: -0.390561
    float_data: 0.067632
    float_data: 0.0870791
    float_data: -0.166769
    float_data: 0.697608
    float_data: 0.382134
    float_data: -0.0238151
    float_data: -0.0644955
    float_data: -0.0300377
    float_data: -1.04387
    float_data: 0.262947
    float_data: -0.0241813
    float_data: -0.109271
    float_data: 0.174351
    float_data: 0.312084
    float_data: -1.18488e-05
    float_data: 0.534099
    float_data: -0.0848411
    float_data: -0.224633
    float_data: 0.623524
    float_data: 0.342488
    float_data: -0.141231
    float_data: 0.331847
    float_data: 0.043032
    float_data: -0.254206
    float_data: 0.0
    float_data: -0.025244
    float_data: 0.0464228
    float_data: -0.0219908
    float_data: -0.0301804
    float_data: -0.0435317
    float_data: 0.0362659
    float_data: -0.0457549
    float_data: 0.0353466
    float_data: 0.025097
    float_data: -0.029229
    float_data: 0.0247895
    float_data: 0.00454759
    float_data: -0.0084636
    float_data: 0.0173988
    float_data: -0.016403
    float_data: 0.04174
    float_data: 0.0441201
    float_data: -0.0426401
    float_data: 0.0379435
    float_data: 0.0263009
    float_data: -0.0112855
    float_data: 0.0225036
    float_data: -0.0173481
    float_data: -0.0213905
    float_data: 0.0300196
    float_data: 0.00149021
    float_data: 0.0203369
    float_data: 0.00419083
    float_data: -0.0214856
    float_data: 0.00472508
    float_data: -0.0430303
    float_data: -0.0321749
    float_data: 0.0143469
    float_data: 0.00317547
    float_data: -0.00523577
    float_data: 0.0414812
    float_data: -0.00402599
    float_data: -0.00216306
    float_data: -0.000462505
    float_data: 0.010856
    float_data: 0.00842059
    float_data: -0.0239806
    float_data: -0.0251719
    float_data: -0.00475373
    float_data: 0.0204342
    float_data: 0.00986964
    float_data: -0.00713987
    float_data: -0.0268979
    float_data: -0.0344808
    float_data: -0.023566
    float_data: -0.025244
    float_data: 0.0
    float_data: 0.225768
    float_data: 0.0218262
    float_data: 0.265326
    float_data: 0.770538
    float_data: -0.344475
    float_data: -0.332806
    float_data: 0.200247
    float_data: -1.80159
    float_data: -0.17079
    float_data: 1.14975
    float_data: 0.0334971
    float_data: 0.100602
    float_data: 1.23712
    float_data: -1.43802
    float_data: -0.431634
    float_data: 0.525167
    float_data: 0.703183
    float_data: 1.19245
    float_data: 0.500943
    float_data: -0.083885
    float_data: -0.291454
    float_data: 0.145929
    float_data: 0.793942
    float_data: 0.580596
    float_data: -0.0141949
    float_data: -0.046021
    float_data: 1.91853
    float_data: 0.168374
    float_data: -0.00860337
    float_data: 0.462992
    float_data: -0.160625
    float_data: -0.35443
    float_data: -0.365801
    float_data: 0.504545
    float_data: 0.171676
    float_data: 0.118798
    float_data: 0.844994
    float_data: -0.0163612
    float_data: 0.408058
    float_data: -0.058101
    float_data: -0.747298
    float_data: -0.0991065
    float_data: -0.763432
    float_data: 0.0660235
    float_data: 0.521441
    float_data: 0.491189
    float_data: 0.795176
    float_data: 0.271052
    float_data: 0.238694
    float_data: 0.368011
    float_data: 0.225768
    float_data: 0.0
    float_data: 0.149962
    float_data: 0.0159546
    float_data: 0.203953
    float_data: -0.377548
    float_data: -0.370995
    float_data: -0.174175
    float_data: 0.127429
    float_data: -0.395659
    float_data: -0.127728
    float_data: -0.15965
    float_data: 0.0216527
    float_data: -0.52095
    float_data: 0.29091
    float_data: 1.33824
    float_data: -0.713739
    float_data: -0.44444
    float_data: 0.173302
    float_data: -0.433336
    float_data: -0.110721
    float_data: 0.312576
    float_data: -0.0438027
    float_data: 0.456102
    float_data: 1.57766
    float_data: -0.841813
    float_data: -0.00170786
    float_data: -0.0419726
    float_data: 1.70492
    float_data: 0.0515999
    float_data: 0.175838
    float_data: 0.0402926
    float_data: 0.175219
    float_data: 0.0832172
    float_data: -0.122928
    float_data: 0.866105
    float_data: 0.270649
    float_data: 0.200287
    float_data: 0.487316
    float_data: -0.0027264
    float_data: 0.207189
    float_data: -0.0898991
    float_data: 0.242916
    float_data: -0.451664
    float_data: 0.116582
    float_data: 0.078352
    float_data: 0.913928
    float_data: -0.393
    float_data: 1.19533
    float_data: -0.950764
    float_data: 0.0153113
    float_data: 0.0401163
    float_data: 0.149962
    float_data: 0.0
    float_data: -0.155202
    float_data: 0.00417461
    float_data: 0.409155
    float_data: -0.0137244
    float_data: -0.368811
    float_data: -0.664114
    float_data: -0.326969
    float_data: 0.197522
    float_data: 0.00831425
    float_data: -0.227614
    float_data: 0.0198412
    float_data: 0.0338173
    float_data: 0.0513551
    float_data: 0.15364
    float_data: 0.768949
    float_data: -0.292628
    float_data: -0.0732583
    float_data: 0.0757407
    float_data: 0.474046
    float_data: -0.403916
    float_data: -0.138478
    float_data: 0.435384
    float_data: 0.70586
    float_data: -0.0293286
    float_data: 0.0337114
    float_data: -0.0280963
    float_data: -2.44196
    float_data: -0.215841
    float_data: -1.1067
    float_data: 0.103018
    float_data: -0.219286
    float_data: 0.226229
    float_data: 0.354199
    float_data: -0.129073
    float_data: 1.19062
    float_data: 0.321081
    float_data: -1.29872
    float_data: -0.00233119
    float_data: 0.0120423
    float_data: -0.21022
    float_data: -0.417442
    float_data: -0.508915
    float_data: -0.643583
    float_data: -0.0748353
    float_data: 0.791134
    float_data: 0.394516
    float_data: 0.541726
    float_data: -0.488094
    float_data: 0.114493
    float_data: 0.213342
    float_data: -0.155202
    float_data: 0.0
    float_data: -0.0172013
    float_data: 0.0174008
    float_data: -0.859508
    float_data: -0.487739
    float_data: -0.0348575
    float_data: 0.215466
    float_data: 0.594883
    float_data: -0.288667
    float_data: 0.0787938
    float_data: -0.135554
    float_data: -0.0471676
    float_data: -0.29227
    float_data: 0.397437
    float_data: -0.457963
    float_data: -0.180023
    float_data: -0.197206
    float_data: 1.27966
    float_data: 0.665245
    float_data: 0.144216
    float_data: 0.192752
    float_data: 0.347759
    float_data: -0.420618
    float_data: -1.05442
    float_data: 0.0777785
    float_data: -0.00534261
    float_data: 0.0271984
    float_data: 0.32648
    float_data: -0.163693
    float_data: 0.713413
    float_data: 0.278331
    float_data: 0.138402
    float_data: -3.45264
    float_data: 0.106878
    float_data: -0.667322
    float_data: -0.146285
    float_data: -0.868847
    float_data: 0.3786
    float_data: -0.0456672
    float_data: -0.0833266
    float_data: -0.649379
    float_data: -0.0627678
    float_data: 0.086945
    float_data: -0.0173197
    float_data: -0.136368
    float_data: -0.732973
